############################################################################################################################################################################################
##############################################################################   页面及菜单管理   ########################################################################################
############################################################################################################################################################################################
#定义全局变量，用于调整等待指令
waitcon=""

function page {
   local title="$1"    #页面标题
   
   while true; do
    # 清除和显示页面样式
    clear
    logo
    pagetitle
    menutitle "$1"
    waitcon="true"      #默认完成一个指令需要等待

    array=("${@:2}")
    menu=()
    cmd=()
    n=1
    
     #判断当前页面是否由上一级页面调用
    if [[ "$CURSHELL" == *"bash"* ]]; then
        if [[ "${FUNCNAME[1]}" == "${FUNCNAME[0]}" ]]; then
              array=("返回上一级菜单" 'waitcon="false"; return' "${array[@]}")
        fi
    elif [[ "$CURSHELL" == *"zsh"* ]]; then
         if [[ "${funcstack[1]}" == "${funcstack[0]}" ]]; then
             array=("返回上一级菜单" 'waitcon="false; return' "${array[@]}")
        fi
    fi
    
    #分离菜单和指令
    for (( i=0; i<${#array[@]}; i++ )); do
        if (( i % 2 == 0 )) ; then
            menu+=("${array[$i]}")
            echo "  [$n]$(((n<10)) && echo " ") ${array[$i]}" 
            ((n++))
        else
            cmd+=("${array[$i]}")
        fi
    done
       echo "  [0]  退出"

    #获取菜单数量
    menunum=${#menu[@]} 
    echo
    echo -n "  请按序号选择操作: "
    inp false 1 '"[[ "$new_text" =~ ^[0-9]+$ ]] && (( $new_text >= 0 && $new_text <= '$((menunum))' ))"'
    [[ "$new_text" == "0" ]] && quit 1              #如果选择零则退出
    clear 
    eval "${cmd[$((new_text-1))]}"  || ( echo "指令执行可能失败，请检查！"; waitcon="true" )
    [[ "$waitcon" == "true" ]] && wait
done
}
